aedile/EmberTide/sdkconfig.defaults
# sdkconfig.defaults — FiestaQuest ESP-IDF SDK configuration defaults
#
# Target: ESP32-S3-PICO-1-N8R8
#   - Xtensa LX7 dual-core @ 240 MHz
#   - 8 MiB SPI Flash (QD)
#   - 8 MiB Octal PSRAM (SPIRAM)
#
# These settings are applied before sdkconfig. Any key not listed here
# uses the ESP-IDF component default.
#
# Phase 23 requirement: IDF 5.5.1+
#   IDF 5.3.x has GDMA interrupt bugs #15533 and 8dfcafa that cause hard faults
#   when I2S and SPI GDMA channels are both active. IDF 5.5.1 fixes both bugs.

# ---------------------------------------------------------------------------
# Partition table
# ---------------------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------------------------------------------------------------------
# Flash size
# ---------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# ---------------------------------------------------------------------------
# SPIRAM (Octal PSRAM on ESP32-S3-PICO-1-N8R8)
# ---------------------------------------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y

# A5 WARNING: CONFIG_SPIRAM_USE_MALLOC=y routes the default heap allocator
# through PSRAM. DMA-capable buffers (e.g. SPI TX/RX, I2S, USB) MUST NOT
# use the default allocator — they will land in PSRAM which is not DMA-
# accessible on this chip. Always allocate DMA buffers with:
#   heap_caps_malloc(size, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL)
# Failure to do so causes silent data corruption on DMA transfers.
CONFIG_SPIRAM_USE_MALLOC=y

# Phase 23: Keep the first 16KB of internal SRAM reserved for ESP-IDF internal
# allocations. This ensures I2S channel handles and DMA descriptors land in
# internal SRAM rather than PSRAM. Without this, the GDMA engine cannot reach
# the handle structure and triggers LoadStoreAlignment exceptions.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# ---------------------------------------------------------------------------
# Target
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---------------------------------------------------------------------------
# FreeRTOS
# ---------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# ---------------------------------------------------------------------------
# Logging (default level: INFO; errors always logged)
# ---------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ---------------------------------------------------------------------------
# Phase 23: Audio subsystem
# ---------------------------------------------------------------------------
# ADV-1: CONFIG_BSP_AUDIO is intentionally NOT set here.
# The symbol is defined as a private compile definition for the fq_hal
# component via target_compile_definitions() in components/fq_hal/CMakeLists.txt.
# Setting it here in sdkconfig.defaults would duplicate the definition and
# could cause build warnings or unexpected behaviour if the sdkconfig value
# is used by a different component. The fq_hal CMakeLists is the single
# authoritative source for this flag.

# ES8311 stereo codec support (used on this board for audio output).
CONFIG_CODEC_ES8311_SUPPORT=y

# GDMA IRAM-safe ISR — intentionally NOT set.
# IDF 5.3 bug: CONFIG_GDMA_ISR_IRAM_SAFE causes a crash when both I2S and SPI
# DMA channels are active simultaneously (race in gdma_isr_handler_install).
# Fixed in IDF 5.5.1, but we leave this flag out as a conservative safety measure
# until we can verify no regression on the target hardware.
# CONFIG_GDMA_ISR_IRAM_SAFE is NOT set.
